'''
თამაში იწყება შეკითხვით " სიმართლე თუ მოქმედება?"
პასუხის მიხედვით გადადის მოცემულობაზე
ცდების მიხედვით ირჩევს შესაბამის ტექსტს
რიგის მიხედვით მიყვება სიმართლეებსა და მოქმედებებს
სისულელე როცა შეგყავს გეკითხება კიდევ გინდა თუ არა
თუ ისევ სისულელე დაწერე თამაშიდან გაგაჯმეინებს
'''
# starting
#-----------------------------------
import time,sys # ანიმაციისათვის
#------------------------------------
# ცდები თავიდან 0 უდრის
# არც სიმართლე გვიკითხავს არც მოქმედება
m=0
s=0
# იწყება ციკლი
while True:
    # სიმართლე თუ მოქმედება?
    stum=input("simartle tu moqmedeba s/m? : ")
#------------------------------------------------------------------------
# ჩატვირთვის ანიმაცია
    blah="\|/-\|/-"
    for l in blah:
        sys.stdout.write(l)
        sys.stdout.flush()
        sys.stdout.write('\b')
        time.sleep(0.15)
#------------------------------------------------------------------------
    # თუ სიმართლე მაშინ
    if stum=="s":
        if s==0:
            # დასვი კითხვა
            print("a?")
            s=s+1
            # ცდას მიუმატე ერთი და თავიდან შედი ციკლში
        # თუ ცდა 2
        elif s==1:
            # დასვი კითხვა
            print("b?")
            s=s+1
            # ცდას მიუმატე ერთი და თავიდან შედი ციკლში
# მოქმედებაზეც ანალოგიურადაა
    elif stum=="m":
        if m==0:
            print("a")
            m=m+1
        elif m==1:
            print("b")
            m=m+1
# სხვა შემთხვევაში თუ სისულელე შეიყვანა ან შეეშალა
    else:
        # თავიდა?
        tavidan=input("tavidan?  (ki/ara): ")
        # თუ კი
        if tavidan=="ki":
                continue
            # ციკლის ცდები ინახება კითხვები და მოქმედება რომ არ განმეორდეს
            # ციკლი რესტარტდება
        # თუ არა ან სისულელე დაწერა ისევ
        else:
            break # დაამთავრა ბაზარი
